{"format":"layers-model","generatedBy":"keras v3.13.2","convertedBy":"TensorFlow.js Converter v4.22.0","modelTopology":{"keras_version":"3.13.2","backend":"tensorflow","model_config":{"class_name":"Functional","config":{"name":"melanoma_vgg16","trainable":true,"layers":[{"class_name":"InputLayer","config":{"batch_input_shape":[null,224,224,3],"dtype":"float32","sparse":false,"ragged":false,"name":"input_layer_1","optional":false},"name":"input_layer_1","inbound_nodes":[]},{"class_name":"Conv2D","config":{"name":"block1_conv1","trainable":false,"dtype":"float32","filters":64,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"block1_conv1","inbound_nodes":[[["input_layer_1",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"block1_conv2","trainable":false,"dtype":"float32","filters":64,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"block1_conv2","inbound_nodes":[[["block1_conv1",0,0,{}]]]},{"class_name":"MaxPooling2D","config":{"name":"block1_pool","trainable":false,"dtype":"float32","pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last"},"name":"block1_pool","inbound_nodes":[[["block1_conv2",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"block2_conv1","trainable":false,"dtype":"float32","filters":128,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"block2_conv1","inbound_nodes":[[["block1_pool",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"block2_conv2","trainable":false,"dtype":"float32","filters":128,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"block2_conv2","inbound_nodes":[[["block2_conv1",0,0,{}]]]},{"class_name":"MaxPooling2D","config":{"name":"block2_pool","trainable":false,"dtype":"float32","pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last"},"name":"block2_pool","inbound_nodes":[[["block2_conv2",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"block3_conv1","trainable":false,"dtype":"float32","filters":256,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"block3_conv1","inbound_nodes":[[["block2_pool",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"block3_conv2","trainable":false,"dtype":"float32","filters":256,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"block3_conv2","inbound_nodes":[[["block3_conv1",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"block3_conv3","trainable":false,"dtype":"float32","filters":256,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"block3_conv3","inbound_nodes":[[["block3_conv2",0,0,{}]]]},{"class_name":"MaxPooling2D","config":{"name":"block3_pool","trainable":false,"dtype":"float32","pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last"},"name":"block3_pool","inbound_nodes":[[["block3_conv3",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"block4_conv1","trainable":false,"dtype":"float32","filters":512,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"block4_conv1","inbound_nodes":[[["block3_pool",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"block4_conv2","trainable":false,"dtype":"float32","filters":512,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"block4_conv2","inbound_nodes":[[["block4_conv1",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"block4_conv3","trainable":false,"dtype":"float32","filters":512,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"block4_conv3","inbound_nodes":[[["block4_conv2",0,0,{}]]]},{"class_name":"MaxPooling2D","config":{"name":"block4_pool","trainable":false,"dtype":"float32","pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last"},"name":"block4_pool","inbound_nodes":[[["block4_conv3",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"block5_conv1","trainable":true,"dtype":"float32","filters":512,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"block5_conv1","inbound_nodes":[[["block4_pool",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"block5_conv2","trainable":true,"dtype":"float32","filters":512,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"block5_conv2","inbound_nodes":[[["block5_conv1",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"block5_conv3","trainable":true,"dtype":"float32","filters":512,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"block5_conv3","inbound_nodes":[[["block5_conv2",0,0,{}]]]},{"class_name":"MaxPooling2D","config":{"name":"block5_pool","trainable":true,"dtype":"float32","pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last"},"name":"block5_pool","inbound_nodes":[[["block5_conv3",0,0,{}]]]},{"class_name":"GlobalAveragePooling2D","config":{"name":"global_average_pooling2d","trainable":true,"dtype":"float32","data_format":"channels_last","keepdims":false},"name":"global_average_pooling2d","inbound_nodes":[[["block5_pool",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense","trainable":true,"dtype":"float32","units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense","inbound_nodes":[[["global_average_pooling2d",0,0,{}]]]},{"class_name":"Dropout","config":{"name":"dropout","trainable":true,"dtype":"float32","rate":0.5,"seed":null,"noise_shape":null},"name":"dropout","inbound_nodes":[[["dense",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense_1","trainable":true,"dtype":"float32","units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense_1","inbound_nodes":[[["dropout",0,0,{}]]]}],"input_layers":[["input_layer_1",0,0]],"output_layers":[["dense_1",0,0]]}},"training_config":{"loss":"binary_crossentropy","loss_weights":null,"metrics":["accuracy"],"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":true,"optimizer_config":{"class_name":"Adam","config":{"name":"adam","learning_rate":0.000001249999968422344,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"beta_1":0.9,"beta_2":0.999,"epsilon":1e-7,"amsgrad":false}}}},"weightsManifest":[{"paths":["group1-shard1of4.bin","group1-shard2of4.bin","group1-shard3of4.bin","group1-shard4of4.bin"],"weights":[{"name":"block1_conv1/kernel","shape":[3,3,3,64],"dtype":"float32","quantization":{"dtype":"uint8","min":-0.6725833037320305,"scale":0.005019278386059929,"original_dtype":"float32"}},{"name":"block1_conv1/bias","shape":[64],"dtype":"float32","quantization":{"dtype":"uint8","min":-0.016312674593691734,"scale":0.008156337296845867,"original_dtype":"float32"}},{"name":"block1_conv2/kernel","shape":[3,3,64,64],"dtype":"float32","quantization":{"dtype":"uint8","min":-0.2157703659698075,"scale":0.0019795446419248394,"original_dtype":"float32"}},{"name":"block1_conv2/bias","shape":[64],"dtype":"float32","quantization":{"dtype":"uint8","min":-1.03059720993042,"scale":0.007577920661253088,"original_dtype":"float32"}},{"name":"block2_conv1/kernel","shape":[3,3,64,128],"dtype":"float32","quantization":{"dtype":"uint8","min":-0.33643827718846936,"scale":0.002951212957793591,"original_dtype":"float32"}},{"name":"block2_conv1/bias","shape":[128],"dtype":"float32","quantization":{"dtype":"uint8","min":-0.1794289034955642,"scale":0.002136058374947193,"original_dtype":"float32"}},{"name":"block2_conv2/kernel","shape":[3,3,128,128],"dtype":"float32","quantization":{"dtype":"uint8","min":-0.1819109429331387,"scale":0.0018010984448825612,"original_dtype":"float32"}},{"name":"block2_conv2/bias","shape":[128],"dtype":"float32","quantization":{"dtype":"uint8","min":-0.5976763715931014,"scale":0.004819970738654043,"original_dtype":"float32"}},{"name":"block3_conv1/kernel","shape":[3,3,128,256],"dtype":"float32","quantization":{"dtype":"uint8","min":-0.18258175195432177,"scale":0.0028528398742862777,"original_dtype":"float32"}},{"name":"block3_conv1/bias","shape":[256],"dtype":"float32","quantization":{"dtype":"uint8","min":-0.20076150368241702,"scale":0.002158725846047495,"original_dtype":"float32"}},{"name":"block3_conv2/kernel","shape":[3,3,256,256],"dtype":"float32","quantization":{"dtype":"uint8","min":-0.17719967487980337,"scale":0.002495770068729625,"original_dtype":"float32"}},{"name":"block3_conv2/bias","shape":[256],"dtype":"float32","quantization":{"dtype":"uint8","min":-0.18064890036395953,"scale":0.0017886029739005893,"original_dtype":"float32"}},{"name":"block3_conv3/kernel","shape":[3,3,256,256],"dtype":"float32","quantization":{"dtype":"uint8","min":-0.17920678737116794,"scale":0.002240084842139599,"original_dtype":"float32"}},{"name":"block3_conv3/bias","shape":[256],"dtype":"float32","quantization":{"dtype":"uint8","min":-0.14174636660837658,"scale":0.0028927829920076856,"original_dtype":"float32"}},{"name":"block4_conv1/kernel","shape":[3,3,256,512],"dtype":"float32","quantization":{"dtype":"uint8","min":-0.12366545971702127,"scale":0.0017175758294030732,"original_dtype":"float32"}},{"name":"block4_conv1/bias","shape":[512],"dtype":"float32","quantization":{"dtype":"uint8","min":-0.14622165473068463,"scale":0.0018052056139590694,"original_dtype":"float32"}},{"name":"block4_conv2/kernel","shape":[3,3,512,512],"dtype":"float32","quantization":{"dtype":"uint8","min":-0.10595030150577134,"scale":0.0017368901886192023,"original_dtype":"float32"}},{"name":"block4_conv2/bias","shape":[512],"dtype":"float32","quantization":{"dtype":"uint8","min":-0.08470387511393604,"scale":0.0010457268532584696,"original_dtype":"float32"}},{"name":"block4_conv3/kernel","shape":[3,3,512,512],"dtype":"float32","quantization":{"dtype":"uint8","min":-0.12787745893001556,"scale":0.0015044406932943008,"original_dtype":"float32"}},{"name":"block4_conv3/bias","shape":[512],"dtype":"float32","quantization":{"dtype":"uint8","min":-0.19759350839783163,"scale":0.0021020585999769323,"original_dtype":"float32"}},{"name":"block5_conv1/kernel","shape":[3,3,512,512],"dtype":"float32","quantization":{"dtype":"uint8","min":-0.11547734266987034,"scale":0.0012155509754723194,"original_dtype":"float32"}},{"name":"block5_conv1/bias","shape":[512],"dtype":"float32","quantization":{"dtype":"uint8","min":-0.34907478795332064,"scale":0.0038786087550368963,"original_dtype":"float32"}},{"name":"block5_conv2/kernel","shape":[3,3,512,512],"dtype":"float32","quantization":{"dtype":"uint8","min":-0.1373384416103363,"scale":0.0013464553099052578,"original_dtype":"float32"}},{"name":"block5_conv2/bias","shape":[512],"dtype":"float32","quantization":{"dtype":"uint8","min":-0.920916290844188,"scale":0.006577973506029914,"original_dtype":"float32"}},{"name":"block5_conv3/kernel","shape":[3,3,512,512],"dtype":"float32","quantization":{"dtype":"uint8","min":-0.09210038062404184,"scale":0.001485490010065191,"original_dtype":"float32"}},{"name":"block5_conv3/bias","shape":[512],"dtype":"float32","quantization":{"dtype":"uint8","min":-0.5063013824762083,"scale":0.03894626019047756,"original_dtype":"float32"}},{"name":"dense/kernel","shape":[512,256],"dtype":"float32","quantization":{"dtype":"uint8","min":-0.2011707058724235,"scale":0.0015356542433009428,"original_dtype":"float32"}},{"name":"dense/bias","shape":[256],"dtype":"float32","quantization":{"dtype":"uint8","min":-0.02758481590186848,"scale":0.00016419533274921716,"original_dtype":"float32"}},{"name":"dense_1/kernel","shape":[256,1],"dtype":"float32","quantization":{"dtype":"uint8","min":-0.23595138390858966,"scale":0.001982784738727644,"original_dtype":"float32"}},{"name":"dense_1/bias","shape":[1],"dtype":"float32","quantization":{"dtype":"uint8","min":-0.021922385320067406,"scale":1,"original_dtype":"float32"}}]}]}